-- MySQL dump 10.13  Distrib 5.5.20, for Win32 (x86)
--
-- Host: localhost    Database: test
-- ------------------------------------------------------
-- Server version	5.5.20

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `student`
--

DROP TABLE IF EXISTS `student`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `student` (
  `sno` varchar(6) NOT NULL,
  `sname` varchar(6) DEFAULT NULL,
  `sex` varchar(2) DEFAULT NULL,
  `bdate` datetime DEFAULT NULL,
  `dept` varchar(8) DEFAULT NULL,
  `classno` varchar(3) DEFAULT NULL,
  PRIMARY KEY (`sno`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `student`
--

LOCK TABLES `student` WRITE;
/*!40000 ALTER TABLE `student` DISABLE KEYS */;
INSERT INTO `student` VALUES ('30201','ÎâÀÚ','ÄÐ','1980-01-02 00:00:00','µçÐÅ','302'),('30202','Ô¬Çà´º','ÄÐ','1980-01-02 00:00:00','µçÐÅ','302'),('30203','ÌÆÀ×','ÄÐ','1980-01-02 00:00:00','µçÐÅ','302'),('30204','Îâö­','ÄÐ','1980-01-02 00:00:00','µçÐÅ','302'),('30206','Á¬ºé³ã','ÄÐ','1980-01-02 00:00:00','µçÐÅ','302'),('30207','Íõ½ðÖù','ÄÐ','1980-01-02 00:00:00','µçÐÅ','302'),('30208','ËÕ¹ãÑ§','ÄÐ','1980-01-02 00:00:00','µçÐÅ','302'),('30209','ÌÆÔªÁÁ','ÄÐ','1980-01-02 00:00:00','µçÐÅ','302'),('30210','¸ðÑÞ½Ü','ÄÐ','1980-01-02 00:00:00','µçÐÅ','302'),('30211','ÕÅÓÀ³¬','ÄÐ','1980-01-02 00:00:00','µçÐÅ','302'),('30212','ÕÅÎ°','ÄÐ','1980-01-02 00:00:00','µçÐÅ','302'),('30213','Ëï¸Õ','ÄÐ','1980-01-02 00:00:00','µçÐÅ','302'),('30214','³µÆ½Ô¾','ÄÐ','1980-01-02 00:00:00','µçÐÅ','302'),('30215','ÕÅöÎ','ÄÐ','1980-01-02 00:00:00','µçÐÅ','302'),('30216','Íõ¿­','ÄÐ','1980-01-02 00:00:00','µçÐÅ','302'),('30217','ÂíÌÎ','ÄÐ','1980-01-02 00:00:00','µçÐÅ','302'),('30218','Íõ¼Ñéª','ÄÐ','1980-01-02 00:00:00','µçÐÅ','302'),('30219','ÂíºÆ','ÄÐ','1980-01-02 00:00:00','µçÐÅ','302'),('30220','ÉÛËÕ½Ü','ÄÐ','1980-01-02 00:00:00','µçÐÅ','302'),('30221','Ö£½¨»ª','ÄÐ','1980-01-02 00:00:00','µçÐÅ','302'),('30222','Ö£Ù©Ñå','ÄÐ','1980-01-02 00:00:00','µçÐÅ','302'),('30223','Äþ½£Ï¼','Å®','1980-01-02 00:00:00','µçÐÅ','302'),('30224','Áúº£Ñà','Å®','1980-01-02 00:00:00','µçÐÅ','302'),('30225','³Â¾ÕÓ¢','Å®','1980-01-02 00:00:00','µçÐÅ','302'),('30226','ÀîÐÂÔª','Å®','1980-01-02 00:00:00','µçÐÅ','302'),('30227','¹ùÐ¡Àò','Å®','1980-01-02 00:00:00','µçÐÅ','302'),('30228','ÍõÙ»','Å®','1980-01-02 00:00:00','µçÐÅ','302'),('31401','¹ù×Ó¾´','ÄÐ','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31402','ºúÑÅ½Ü','ÄÐ','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31403','ÑîÀÚ','ÄÐ','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31404','·ëÓîÄþ','ÄÐ','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31405','»ÆÈÙ','ÄÐ','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31406','ËÎÔÂ','ÄÐ','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31407','ÕÔÎÀ¾©','ÄÐ','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31408','ÁõÊ÷¿ý','ÄÐ','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31409','Å£º£·æ','ÄÐ','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31410','ÎâÄþ','ÄÐ','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31411','Ã«ÎÄÁÁ','ÄÐ','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31412','Áõ¿¡ÁÁ','ÄÐ','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31413','Àî³Ðª','ÄÐ','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31414','Íõ³¯Ô¶','ÄÐ','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31415','Áõè¡','ÄÐ','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31416','ÐìÁÁÁÁ','ÄÐ','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31417','ÕÅ³¬','ÄÐ','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31418','ËÕÐñºÆ','ÄÐ','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31419','´Þ½­Æ½','ÄÐ','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31420','ÌÆ·É','ÄÐ','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31422','ÁÖê¿','Å®','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31423','²ÙÄµµ¤','Å®','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31424','ÕÅÀÖÔ°','ÎÞ','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31425','À×Ë¬','Å®','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31426','ÇØÁéÁæ','Å®','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31427','»Æ½ð»¨','Å®','1980-01-02 00:00:00','¼ÆËã»ú','314'),('31428','ÕÅÃô','Å®','1980-01-02 00:00:00','¼ÆËã»ú','314');
/*!40000 ALTER TABLE `student` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2012-03-31 16:26:40
