import numpy as np


class MyDataSet:
    """
    My dataset class
    """

    def __init__(self,
                 data=None,
                 feature_names=None,
                 target=None,
                 target_names=None,
                 test=None,
                 test_target=None):
        """
        :param data:
        :param feature_names:
        :param target:
        :param target_names:
        :param test:
        :param test_target:
        """
        self.data = data
        self.feature_names = feature_names
        self.target = target
        self.target_names = target_names
        self.test = test
        self.test_target = test_target

    def load_watermelon2(self):
        """
        Create a test data set with continuous values in the values
        """

        self.data = [['青绿', '蜷缩', '浊响', '清晰', '凹陷', '硬滑'],
                     ['乌黑', '蜷缩', '沉闷', '清晰', '凹陷', '硬滑'],
                     ['乌黑', '蜷缩', '浊响', '清晰', '凹陷', '硬滑'],
                     ['青绿', '稍蜷', '浊响', '清晰', '稍凹', '软粘'],
                     ['乌黑', '稍蜷', '浊响', '稍糊', '稍凹', '软粘'],
                     ['青绿', '硬挺', '清脆', '清晰', '平坦', '软粘'],
                     ['浅白', '稍蜷', '沉闷', '稍糊', '凹陷', '硬滑'],
                     ['乌黑', '稍蜷', '浊响', '清晰', '稍凹', '软粘'],
                     ['浅白', '蜷缩', '浊响', '模糊', '平坦', '硬滑'],
                     ['青绿', '蜷缩', '沉闷', '稍糊', '稍凹', '硬滑']]
        self.test = [['青绿', '蜷缩', '沉闷', '清晰', '凹陷', '硬滑'],
                     ['浅白', '蜷缩', '浊响', '清晰', '凹陷', '硬滑'],
                     ['乌黑', '稍蜷', '浊响', '清晰', '稍凹', '硬滑'],
                     ['乌黑', '稍蜷', '沉闷', '稍糊', '稍凹', '硬滑'],
                     ['浅白', '硬挺', '清脆', '模糊', '平坦', '硬滑'],
                     ['浅白', '蜷缩', '浊响', '模糊', '平坦', '软粘'],
                     ['青绿', '稍蜷', '浊响', '稍糊', '凹陷', '硬滑']]
        self.feature_names = ['色泽', '根蒂', '敲击', '纹理', '脐部', '触感']
        self.target = [1, 1, 1, 1, 1, 0, 0, 0, 0, 0]
        self.test_target = [1, 1, 1, 0, 0, 0, 0]
        self.target_names = np.array(['好瓜', '坏瓜'])

    def load_watermelon3(self):
        """
        Create a test data set with continuous values in the values
        """

        self.data = [['青绿', '蜷缩', '浊响', '清晰', '凹陷', '硬滑', 0.697, 0.460],
                     ['乌黑', '蜷缩', '沉闷', '清晰', '凹陷', '硬滑', 0.774, 0.376],
                     ['乌黑', '蜷缩', '浊响', '清晰', '凹陷', '硬滑', 0.634, 0.264],
                     ['青绿', '蜷缩', '沉闷', '清晰', '凹陷', '硬滑', 0.608, 0.318],
                     ['浅白', '蜷缩', '浊响', '清晰', '凹陷', '硬滑', 0.556, 0.215],
                     ['青绿', '稍蜷', '浊响', '清晰', '稍凹', '软粘', 0.403, 0.237],
                     ['乌黑', '稍蜷', '浊响', '稍糊', '稍凹', '软粘', 0.481, 0.149],
                     ['乌黑', '稍蜷', '浊响', '清晰', '稍凹', '硬滑', 0.437, 0.211],
                     ['乌黑', '稍蜷', '沉闷', '稍糊', '稍凹', '硬滑', 0.666, 0.091],
                     ['青绿', '硬挺', '清脆', '清晰', '平坦', '软粘', 0.243, 0.267],
                     ['浅白', '硬挺', '清脆', '模糊', '平坦', '硬滑', 0.245, 0.057],
                     ['浅白', '蜷缩', '浊响', '模糊', '平坦', '软粘', 0.343, 0.099],
                     ['青绿', '稍蜷', '浊响', '稍糊', '凹陷', '硬滑', 0.639, 0.161],
                     ['浅白', '稍蜷', '沉闷', '稍糊', '凹陷', '硬滑', 0.657, 0.198],
                     ['乌黑', '稍蜷', '浊响', '清晰', '稍凹', '软粘', 0.360, 0.370],
                     ['浅白', '蜷缩', '浊响', '模糊', '平坦', '硬滑', 0.593, 0.042],
                     ['青绿', '蜷缩', '沉闷', '稍糊', '稍凹', '硬滑', 0.719, 0.103]]
        self.feature_names = ['色泽', '根蒂', '敲击', '纹理', '脐部', '触感', '密度', '含糖率']
        self.target = [1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]
        self.target_names = np.array(['好瓜', '坏瓜'])
